<template>
  <a-card :hoverable="true" title="关键词排行" size="small"
    ><div id="canvas1" class="w-full h-170"></div
  ></a-card>
</template>
<script lang="ts">
  import { defineComponent } from 'vue';
  import { Card } from 'ant-design-vue';

  export default defineComponent({
    components: {
      [Card.name]: Card,
    },
  });
</script>
<script lang="ts" setup>
  import { onMounted } from 'vue';
  import { Bar } from '@antv/g2plot';

  const data = [
    { 地区: '华东', 销售额: 4684506.442 },
    { 地区: '中南', 销售额: 4137415.0929999948 },
    { 地区: '东北', 销售额: 2681567.469000001 },
    { 地区: '华北', 销售额: 2447301.017000004 },
    { 地区: '西南', 销售额: 1303124.508000002 },
    { 地区: '西北', 销售额: 815039.5959999998 },
    { 地区: '2', 销售额: 815039.5959999998 },
    { 地区: '3', 销售额: 815039.5959999998 },
    { 地区: '4', 销售额: 815039.5959999998 },
    { 地区: '西5北', 销售额: 815039.5959999998 },
    { 地区: '西6北', 销售额: 815039.5959999998 },
    { 地区: '西8北', 销售额: 815039.5959999998 },
    { 地区: '西7北', 销售额: 815039.5959999998 },
    { 地区: '西0北', 销售额: 815039.5959999998 },
    { 地区: '西9北', 销售额: 815039.5959999998 },
    { 地区: '西13北', 销售额: 815039.5959999998 },
    { 地区: '西12北', 销售额: 815039.5959999998 },
    { 地区: '西122北', 销售额: 815039.5959999998 },
    { 地区: '西3214北', 销售额: 815039.5959999998 },
    { 地区: '西1243北', 销售额: 815039.5959999998 },
    { 地区: '西435北', 销售额: 815039.5959999998 },
    { 地区: '西4362北', 销售额: 815039.5959999998 },
    { 地区: '西135北', 销售额: 815039.5959999998 },
    { 地区: '西1224北', 销售额: 815039.5959999998 },
    { 地区: '西543北', 销售额: 815039.5959999998 },
    { 地区: '西654北', 销售额: 815039.5959999998 },
    { 地区: '西11北', 销售额: 815039.5959999998 },
    { 地区: '西111北', 销售额: 815039.5959999998 },
  ];

  onMounted(() => {
    const lo = {
      title: {
        visible: true,
        text: '基础条形图',
      },
      forceFit: true,
      data,
      xField: '销售额',
      yField: '地区',
      label: {
        visible: true,
        formatter: (v) => Math.round(v / 10000) + '万',
      },
      yAxis: {
        label: {
          autoRotate: false,
        },
      },
      scrollbar: {
        type: 'vertical',
      },
    };

    const barPlot = new Bar('canvas1', lo);

    barPlot.render();
  });
</script>
